{
  "main": {
    "name":"Lev Bakin",
    "description":"I'm a frontend web developer trying to make interesting and engaging websites. My current favorite project is Terrain Guessr, a game that drops you on a terrain map and challenges you to find yourself.",
    "image":"profilepic.jpg",
    "bio":"When I'm not coding, I like to go backpacking and ride my snowboard. My more sedentary hobbies have me reading, looking at maps, and playing video games. In particular, I frequently play an arcade game called Killer Queen, where I lead the local Madison group and have won major national tournaments.",
    "contactmessage":"If you'd like to get in touch, you can contact me at the phone number or email below.",
    "email": "levbakin@gmail.com",
    "phone": "408-394-3627",
    "github":"https://github.com/lbakin",
    "project":"https://github.com/lbakin/terrain-guessr",
    "address":{
      "street":"",
      "city":"Madison",
      "state":"WI",
      "zip": "53703"
    },
    "website": "lbakin.github.io",
    "resumedownload":"./Resume_LB.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/lev-bakin-444b9344/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"facebook",
        "url":"https://www.facebook.com/lev.bakin/",
        "className":"fa fa-facebook"
      },
      {
        "name":"github",
        "url":"https://github.com/lbakin",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education": [
      {
        "school":"University of California, Santa Cruz",
        "degree":"BS Earth Sciences",
        "graduated":"June 2012",
        "description":""
      },
      {
        "school":"The Complete 2020 Web Dev Bootcamp by Angela Yu",
        "degree":"",
        "graduated":"2020",
        "description":""
      }

    ],
    "work":[
      {
        "company":"Web Development Intern",
        "title":"Wisconsin Dept of Children & Families",
        "years":"April 2021 - Nov 2021",
        "description":"I administrated the internal and external sites run by DCF, and ensured all pages were up to date. During the internship, I learned how to utilize the Drupal CMS, integrate Vue.js widgets, and debug PHP scripts. It was a great experience serving the public and helping ensure people's needs were met."
                
      },
      {
        "company":"Frontend Web Developer",
        "title":"",
        "years":"May 2020 - Present",
        "description": "Consistently growing my skills and experience throughout various contracts and projects, including in non web development based areas such as graphic design. My current focus is upgrading the Terrain Guessr site with a leaderboard database and a couple other small features that I think people will enjoy."
      },
      {
        "company":"Continental Mapping Consultants",
        "title":"Geospatial Analyst",
        "years":"June 2018 - April 2019",
        "description":"Extracted features from satellite imagery (ie. roads, buildings, rivers) and denoted their relevant attributes for use in government operations. This information was entered into the project database, manipulated with SQL, and delivered to the client."
      }
    ],
    "skillmessage":"These are my favorite technologies to work with when building websites",
    "tech":[
      {
        "name":"jQuery",
        "description":"I appreciate that jquery allows me to quickly create the functionality I need without the longer setup vanilla js often requires.",
        "image": "jquery.png"
      },
      {
        "name":"Git",
        "description":"I've used Git for version control in small teams as well as uploading my personal projects to github or heroku.",
        "image": "git.png"
      },
      {
        "name":"Vue.js",
        "description":"I love how easy to use and lightweight Vue is. My projects involving Vue have been smaller and the ease of integration has been wonderful.",
        "image": "vuejs.png"
      },
      {
        "name":"Bootstrap",
        "description":"I hope to never take Bootstrap for granted. I appreciate how cleanly this framework allows me to manipulate the css and general layout.",
        "image": "bootstrap.jpg"
      },
      {
        "name":"Drupal",
        "description":"This CMS is great for administering large numbers of users and all the varying functionality it offers.",
        "image": "drupal.png"
      },
      
      
      {
        "name":"PHP and MySQL",
        "description":"I'm still quite inexperienced on the backend, but have found PHP and MySQL to be pretty intuitive to setup and work with.",
        "image": "php-mysql.jpg"
      }
    ],
    "skills":[
      
      {
        "name":"ArcGIS",
        "level":"70%"
      },
      {
        "name":"CSS",
        "level":"60%"
      },
      {
        "name":"Git",
        "level":"50%"
      },
      {
        "name":"Javascript",
        "level":"60%"
      },
      {
        "name":"Python",
        "level":"10%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"SQL",
        "level":"40%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Terrain Guessr",
        "category":"A game to challenge your geography skills",
        "image":"terrain-guessr.png",
        "url":"https://terrain-guessr.herokuapp.com/"
      },
      {
        "title":"DCF Site",
        "category":"Dept of Children & Families public website",
        "image":"dcf.png",
        "url":"https://dcf.wisconsin.gov/"
      },
      {
        "title":"First Site",
        "category":"(Offline now) This was the first site I ever created! Link goes to my github repository where the code is hosted.",
        "image":"first-site.png",
        "url":"lbakin.github.io"
      }
      
    ]
  }
}
